app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs" WHERE "docs"."user_id" = ?  [["user_id", 1]]
---
	def index
		@docs=Doc.where(user_id: current_user)

INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Second Document"], ["content", "Testing Doc"], ["created_at", "2019-06-25 11:01:05.284884"], ["updated_at", "2019-06-25 11:01:05.284884"], ["user_id", 1]]
---
	def create
		@doc = current_user.docs.build(doc_params)

		if @doc.save

UPDATE "docs" SET "title" = ?, "updated_at" = ? WHERE "docs"."id" = ?  [["title", "First "], ["updated_at", "2019-06-25 10:30:26.579156"], ["id", 1]]
---
	def update
		if @doc.update(doc_params)

DELETE FROM "docs" WHERE "docs"."id" = ?  [["id", 2]]
---
	def destroy
		@doc.destroy

SELECT "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def find_doc
		@doc=Doc.find(params[:id])